#### Terraform Apply 🚀`failure`
<details><summary>Show Apply</summary>

```

Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

The remote workspace is configured to work with configuration at
dev relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/learn-terraform-github-actions/learn-terraform-github-actions/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/learn-terraform-github-actions/learn-terraform-github-actions

To view this run in a browser, visit:
https://app.terraform.io/app/koichi-furukawa/learn-terraform-github-actions-dev/runs/run-B8jq5JyRbhWFoLri

Waiting for the plan to start...

Terraform v1.6.4
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure_bot.azuread_application.application will be created
  + resource "azuread_application" "application" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "example-application"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)
    }

  # module.azure_bot.azurerm_bot_service_azure_bot.azure_bot will be created
  + resource "azurerm_bot_service_azure_bot" "azure_bot" {
      + display_name                 = (known after apply)
      + icon_url                     = "https://docs.botframework.com/static/devportal/client/images/bot-framework-default.png"
      + id                           = (known after apply)
      + local_authentication_enabled = true
      + location                     = "global"
      + microsoft_app_id             = (known after apply)
      + microsoft_app_type           = "MultiTenant"
      + name                         = "example-bot"
      + resource_group_name          = "example-rg"
      + sku                          = "F0"
      + streaming_endpoint_enabled   = false
    }

  # module.azure_bot.azurerm_resource_group.azure_bot_rg will be created
  + resource "azurerm_resource_group" "azure_bot_rg" {
      + id       = (known after apply)
      + location = "japaneast"
      + name     = "example-rg"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

module.azure_bot.azuread_application.application: Creating...
module.azure_bot.azurerm_resource_group.azure_bot_rg: Creating...
module.azure_bot.azuread_application.application: Creation complete after 4s [id=/applications/570e7dd3-7729-45f3-a317-aebb81b8640d]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Creation complete after 3s [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/example-rg]
module.azure_bot.azurerm_bot_service_azure_bot.azure_bot: Creating...
╷
│ Error: creating Bot Service: (Name "example-bot" / Resource Group "example-rg"): botservice.BotsClient#Create: Failure responding to request: StatusCode=400 -- Original Error: autorest/azure: Service returned an error. Status=400 Code="InvalidBotData" Message="Bot is not valid. Errors: The bot name is already registered to another bot application..  See https://docs.microsoft.com/azure/bot-service/bot-service-resources-bot-framework-faq?view=azure-bot-service-4.0 for detailed requirements."
│
│   with module.azure_bot.azurerm_bot_service_azure_bot.azure_bot,
│   on ../modules/azure-bot/main.tf line 13, in resource "azurerm_bot_service_azure_bot" "azure_bot":
│   13: resource "azurerm_bot_service_azure_bot" "azure_bot" {
│
│ creating Bot Service: (Name "example-bot" / Resource Group "example-rg"):
│ botservice.BotsClient#Create: Failure responding to request: StatusCode=400
│ -- Original Error: autorest/azure: Service returned an error. Status=400
│ Code="InvalidBotData" Message="Bot is not valid. Errors: The bot name is
│ already registered to another bot application..  See
│ https://docs.microsoft.com/azure/bot-service/bot-service-resources-bot-framework-faq?view=azure-bot-service-4.0
│ for detailed requirements."
╵
Operation failed: failed running terraform apply (exit 1)

```

</details>

*Pusher: @kooooichi24, Action: `push`, Working Directory: ``, Workflow: `Terraform Apply`*